const recipeIngredients = {
    "집에서 즐기는 마라탕": [
    "마라 소스",
    "사골 육수",
    "청경채",
    "배추",
    "소고기 샤브용",
    "분모자",
    "푸주",
    "면",
    "숙주",
    "팽이버섯",
    "어묵",
    "소시지",
    "마늘"
    ],

    "상큼 시원 자몽 에이드": [
    "자몽",
    "자몽 청",
    "자몽 시럽",
    "탄산수",
    "얼음",
    "민트",
    "레몬 슬라이스"
    ],

    "김치볶음밥": [
    "밥",
    "김치",
    "돼지고기",
    "참치",
    "양파",
    "버터",
    "식용유",
    "고춧가루",
    "간장",
    "굴소스",
    "참기름",
    "설탕"
    ],

    "달콤한 허니 버터 갈릭 쉬림프": [
    "새우",
    "대하",
    "버터",
    "다진 마늘",
    "꿀",
    "올리고당",
    "소금",
    "후추",
    "파슬리 가루"
    ],

    "5분 완성! 초간단 샐러드 파스타": [
    "파스타",
    "푸실리",
    "펜네",
    "어린잎 채소",
    "방울토마토",
    "오리엔탈 드레싱",
    "파마산 치즈"
    ],

    "단짠단짠 마약 옥수수": [
    "옥수수",
    "통조림 옥수수",
    "마요네즈",
    "설탕",
    "소금",
    "파마산 치즈",
    "고춧가루",
    "파슬리 가루"
    ],

    "고급진 부채살 스테이크": [
    "부채살 소고기",
    "올리브 오일",
    "버터",
    "통마늘",
    "로즈마리",
    "소금",
    "후추"
    ],

    "정통 까르보나라": [
    "스파게티 면",
    "관찰레",
    "베이컨",
    "계란 노른자",
    "페코리노 치즈",
    "후추",
    "면수"
    ]
};
